; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	image0 - mode
	image1 - mode
	image3 - mode
	GroundStation0 - direction
	Star4 - direction
	Star2 - direction
	Star3 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(supports instrument2 image3)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Star5 image3)
	(have_image Star6 thermograph2)
	(have_image Star7 image1)
	(have_image Phenomenon8 thermograph2)
	(have_image Planet9 image1)
	(have_image Star10 image0)
	(have_image Planet11 image0)
	(have_image Star12 thermograph2)
	(have_image Phenomenon13 thermograph2)
	(have_image Planet14 thermograph2)
	(have_image Star15 image1)
	(have_image Star16 image0)
	(have_image Star17 image1)
	(have_image Phenomenon18 image0)
))

)

; plan
1. (turn_to satellite0 star2 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star2)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 15
4. (turn_to satellite0 star12 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star12)
   goals met: 0 of 15
5. (take_image satellite0 star12 instrument0 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 1 of 15
6. (turn_to satellite0 planet14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet14)
   goals met: 1 of 15
7. (take_image satellite0 planet14 instrument0 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 2 of 15
8. (turn_to satellite0 phenomenon8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 15
9. (take_image satellite0 phenomenon8 instrument0 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 3 of 15
10. (turn_to satellite0 phenomenon13 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 15
11. (take_image satellite0 phenomenon13 instrument0 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 4 of 15
12. (turn_to satellite0 star5 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star5)
   goals met: 4 of 15
13. (take_image satellite0 star5 instrument0 image3)
   added: (have_image star5 image3)
   goals met: 5 of 15
14. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 5 of 15
15. (take_image satellite0 star6 instrument0 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 6 of 15
16. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 15
17. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 15
18. (turn_to satellite0 star1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star1)
   goals met: 6 of 15
19. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 6 of 15
20. (turn_to satellite0 phenomenon18 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon18)
   goals met: 6 of 15
21. (take_image satellite0 phenomenon18 instrument2 image0)
   added: (have_image phenomenon18 image0)
   goals met: 7 of 15
22. (turn_to satellite0 planet11 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet11)
   goals met: 7 of 15
23. (take_image satellite0 planet11 instrument2 image0)
   added: (have_image planet11 image0)
   goals met: 8 of 15
24. (turn_to satellite0 planet9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet9)
   goals met: 8 of 15
25. (take_image satellite0 planet9 instrument2 image1)
   added: (have_image planet9 image1)
   goals met: 9 of 15
26. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 9 of 15
27. (take_image satellite0 star10 instrument2 image0)
   added: (have_image star10 image0)
   goals met: 10 of 15
28. (turn_to satellite0 star15 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star15)
   goals met: 10 of 15
29. (take_image satellite0 star15 instrument2 image1)
   added: (have_image star15 image1)
   goals met: 11 of 15
30. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 11 of 15
31. (take_image satellite0 star16 instrument2 image0)
   added: (have_image star16 image0)
   goals met: 12 of 15
32. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 12 of 15
33. (take_image satellite0 star17 instrument2 image1)
   added: (have_image star17 image1)
   goals met: 13 of 15
34. (turn_to satellite0 star7 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star7)
   goals met: 13 of 15
35. (take_image satellite0 star7 instrument2 image1)
   added: (have_image star7 image1)
   goals met: 14 of 15
36. (turn_to satellite0 star3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star3)
   goals met: 15 of 15
